[
        {
      "title": "AI Tools Workshop Instructor",
      "subtitle": "University of Isfahan",
      "location": "Isfahan Province, Iran",
      "date": "Jan 2026 – Jan 2026",
      "icon": "faChalkboardTeacher",
      "description": "Conducted hands‑on workshop on practical AI tools for students of Administrative Sciences and Economics.",
      "fullDescription": "Delivered a hands‑on workshop teaching prompt engineering, AI chatbots, AI‑assisted research, advanced search, and AI presentation tools, enabling immediate real‑world application in academic and professional settings."
    },
      {
      "title": "AI Workshop Mentor",
      "subtitle": "Farkhondeh Food Industries",
      "location": "Isfahan, Isfahan Province, Iran",
      "date": "Nov 2025 – Nov 2025",
      "icon": "faUsers",
      "description": "Mentored executives in generative AI workshops.",
      "fullDescription": "Co-facilitated practical workshops for Teams from Isfahan, Tehran & Dubai, focusing on generative AI tools (ChatGPT, Grok, Gemini, DeepSeek, Qwen, Krea, Julius AI, Sider AI, Gamma, N8N, Cursor) to foster innovation and data-driven decision-making."
    },
      {
      "title": "Teaching Assistant – Advanced Database (Dr. Mohammad Ali Nematbakhsh)",
      "subtitle": "University of Isfahan",
      "location": "Isfahan Province, Iran",
      "date": "Oct 2025 – feb 2026",
      "icon": "faChalkboardTeacher",
      "description": "Assisted in developing Deep and practical excercises ",
      "fullDescription": "Designed 6 end-to-end, hands-on engineering projects—from JSON/XML and MapReduce to Medallion Architecture—culminating in an Uber-scale analytics platform processing 148K+ real-world records, while mentoring students on advanced indexing, ACID transactions, and LLM-powered Text-to-SQL with vector search."
    },
        {
      "title": "Teaching Assistant – Advanced Algorithms (Dr. Afsaneh Fatemi)",
      "subtitle": "University of Isfahan",
      "location": "Isfahan Province, Iran",
      "date": "Oct 2025 – feb 2026",
      "icon": "faChalkboardTeacher",
      "description": "Assisted in developing Deep and practical excercises ",
      "fullDescription": "Develop engaging practical and coding exercises to enhance student learning and application of advanced algorithmic concepts."
    },
    {
      "title": "Teaching Assistant – Natural Language Processing (Dr. Reza Ramezani)",
      "subtitle": "University of Isfahan",
      "location": "Isfahan Province, Iran",
      "date": "Jul 2025 – Present",
      "icon": "faChalkboardTeacher",
      "description": "Assisted in course design and resource compilation for NLP.",
      "fullDescription": "Supported course preparation including syllabus design and resource compilation (GitHub, Kaggle, academic courses, books) & Prepare Educational Slides for 'Text Preprocessing' and 'Large Language models' Chapters."
    },
    {
      "title": "RAG Research Branch Member",
      "subtitle": "University of Isfahan",
      "location": "Isfahan Province, Iran",
      "date": "Nov 2024 – Present",
      "icon": "faFlask",
      "description": "Contributed to cutting-edge RAG and LLM research.",
      "fullDescription": "As an active member of the RAG research branch, I contribute to advancements in Retrieval-Augmented Generation (RAG), Large Language Models (LLMs) and AI Agents under esteemed professors."
    },
    {
      "title": "Big Data Branch Member",
      "subtitle": "University of Isfahan",
      "location": "Isfahan, Isfahan Province, Iran",
      "date": "Oct 2024 – Present",
      "icon": "faUsers",
      "description": "Collaborated on innovative big data research projects.",
      "fullDescription": "As a member of the Big Data Research Group (est. 2017), comprising 6 faculty members, 30 PhD candidates, and 30 master’s students, I contribute to cutting-edge research in data science and big data technologies, fostering collaborative innovation."
    },
    {
      "title": "Teaching Assistant – Semantic Web and Knowledge Graph (Dr. Reza Ramezani)",
      "subtitle": "University of Isfahan",
      "location": "Isfahan, Isfahan Province, Iran",
      "date": "Apr 2025 – Jun 2025",
      "icon": "faChalkboardTeacher",
      "description": "Led 'Association Rules' module and designed projects.",
      "fullDescription": "Collaborated with a team of TAs to support the Semantic Web and Knowledge Graph course. Took ownership of the 'Association Rules' module, delivering in-person sessions, designing practical projects, and conducting exams to enhance student understanding."
    },
    {
      "title": "Co-Developer & AI Agent Engineer",
      "subtitle": "Isfahan University of Medical Sciences",
      "location": "Isfahan, Isfahan Province, Iran",
      "date": "Jun 2025 – nov 2026",
      "icon": "faCode",
      "description": "Developed AI-driven maternal healthcare platform.",
      "fullDescription": "Co-developed a conversational AI assistant for a digital maternal care platform. Responsibilities included: designing a conversational agent, implementing long-term user memory, building frontend components for onboarding, and ensuring ethical AI use in healthcare."
    },
    {
      "title": "Admin & Content Creator",
      "subtitle": "Dunijet | دانیجت",
      "location": "",
      "date": "Jun 2025 – Present",
      "icon": "faPenNib",
      "description": "Created educational AI content for broad audiences.",
      "fullDescription": "Tracked latest developments in LLMs, NLP, and AGI, writing summaries, commentaries, and explainers on cutting-edge tools, and creating educational posts for beginners and practitioners."
    },
    {
      "title": "AI Workshop Mentor",
      "subtitle": "Esfahan's Mobarakeh Steel Company",
      "location": "Isfahan, Isfahan Province, Iran",
      "date": "Dec 2024 – May 2025",
      "icon": "faUsers",
      "description": "Mentored executives in generative AI workshops.",
      "fullDescription": "Co-facilitated practical workshops for over 400 managers and executives, focusing on generative AI tools (ChatGPT, Grok, Gemini, DeepSeek, Qwen, Krea, Julius AI, Sider AI, Gamma) to foster innovation and data-driven decision-making. Designed and delivered 9 tailored sessions, leading interactive demos and real-case discussions."
    },
    {
      "title": "Booth Lead – Big Data Group",
      "subtitle": "University of Isfahan",
      "location": "Isfahan, Isfahan Province, Iran",
      "date": "Feb 24 – Feb 26, 2025",
      "icon": "faUsers",
      "description": "Led Big Data group booth at national AI conference.",
      "fullDescription": "Served as Booth Lead at the 1st National Biennial Conference on AI Applications in Traffic Control (Feb 24–26, 2025), presenting Big Data group achievements and facilitating discussions on urban and road management solutions."
    },
    {
      "title": "Researcher – Researchers and Elite Club",
      "subtitle": "Islamic Azad University",
      "location": "Isfahan, Isfahan Province, Iran",
      "date": "Nov 2023 – Nov 2024",
      "icon": "faBook",
      "description": "Authored books on Python, Git, and GitHub.",
      "fullDescription": "As a member of the Researchers and Elite Club, authored books on Python, Git, and GitHub, sharing computer science knowledge with the community to support learning and development."
    },
    {
      "title": "Teaching Assistant – Programming Fundamentals",
      "subtitle": "Islamic Azad University",
      "location": "Isfahan, Isfahan Province, Iran",
      "date": "Apr 2023 – Mar 2024",
      "icon": "faChalkboardTeacher",
      "description": "Taught C++ programming and soft skills.",
      "fullDescription": "Supported students in learning C++ programming through real-world examples and project-based learning, emphasizing clean code practices. Introduced software engineering fields and taught soft skills like communication and problem-solving to prepare students for careers."
    },
    {
      "title": "Research Assistant (Dr. Koorosh Hadian)",
      "subtitle": "Islamic Azad University",
      "location": "Isfahan Province, Iran",
      "date": "Aug 2022 – Nov 2022",
      "icon": "faBook",
      "description": "Contributed to historical research on Cyrus the Great.",
      "fullDescription": "Collaborated with Dr. Koorosh Hadian on a research book about Cyrus the Great, analyzing primary sources and contributing to scholarly work, enhancing my passion for academic research and writing."
    },
    {
      "title": "Podcast Host – Semicast",
      "subtitle": "Self-Produced",
      "location": "Online",
      "date": "Aug 2023 – Sep 2023",
      "icon": "faBook",
      "description": "Hosted and produced a 4-episode programming podcast series, amassing over 2,000 listeners.",
      "fullDescription": "Created and hosted “Semicast,” a podcast focused on entry-level programming concepts. Produced and published four episodes via my Telegram channel, attracting 2,000+ listeners and driving community engagement through clear, example-driven explanations."
    },    
    {
      "title": "Intern – IT Department",
      "subtitle": "SnappCarFix",
      "location": "Isfahan, Isfahan Province, Iran",
      "date": "Feb 2023 – May 2023",
      "icon": "faUserGraduate",
      "description": "Developed IT and soft skills in business environment.",
      "fullDescription": "Collaborated on IT projects, gained familiarity with business systems and technologies, and improved soft skills such as teamwork, problem-solving, and communication in a dynamic business setting."
    }
]